# Thresholds
IMG_SIZE_THRESHOLD = 3500 # This can be pixel^2 because it also shows image resolution
OCR_CONF_THRESHOLD = 0.2
YBBOX_DIS_THRESHOLD = 0.15 # This one and below should be fraction because not all images have same resolution
XBBOX_DIS_THRESHOLD = 0.12

# Positions
PLATE_NUM_XPOS = 0.5
PLATE_NUM_YPOS = 0.33
PLATE_PRO_XPOS = 0.5
PLATE_PRO_YPOS = 0.8

# Provinces
PROVINCES = [
    "กรุงเทพมหานคร", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร",
    "ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท",
    "ชัยภูมิ", "ชุมพร", "เชียงใหม่", "เชียงราย", "ตรัง",
    "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม",
    "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี", "นราธิวาส",
    "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
    "ปราจีนบุรี", "ปัตตานี", "พะเยา", "พังงา", "พัทลุง",
    "พิจิตร", "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเก็ต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
    "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง",
    "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน",
    "เลย", "ศรีสะเกษ", "สกลนคร", "สระแก้ว", "สมุทรปราการ","สมุทรสงคราม","สมุทรสาคร",
    "สุโขทัย", "สุพรรณบุรี", "สุรินทร์", "สุราษฎร์ธานี", "สตูล",
    "สงขลา", "สิงห์บุรี", "สระบุรี","หนองคาย","หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี", "อยุธยา"
    "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี"
]
